Shubh1122000-coder/3BaseEncoder_STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Head_EncA_Pin GPIO_PIN_0
#define Head_EncA_GPIO_Port GPIOC
#define Head_EncA_EXTI_IRQn EXTI0_IRQn
#define Head_EncB_Pin GPIO_PIN_1
#define Head_EncB_GPIO_Port GPIOC
#define Head_EncB_EXTI_IRQn EXTI1_IRQn
#define Right_EncB_Pin GPIO_PIN_2
#define Right_EncB_GPIO_Port GPIOC
#define Right_EncB_EXTI_IRQn EXTI2_IRQn
#define Right_EncA_Pin GPIO_PIN_4
#define Right_EncA_GPIO_Port GPIOA
#define Right_EncA_EXTI_IRQn EXTI4_IRQn
#define Left_EncA_Pin GPIO_PIN_14
#define Left_EncA_GPIO_Port GPIOB
#define Left_EncA_EXTI_IRQn EXTI15_10_IRQn
#define Left_EncB_Pin GPIO_PIN_3
#define Left_EncB_GPIO_Port GPIOB
#define Left_EncB_EXTI_IRQn EXTI3_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
